import random

#1: Добавление элемента в начале и в конце массива "вручную"
""" Вам дан массив целых чисел arr, основанный на Python-списке
    (Можно генерировать этот массив случаным образом).
    Добавьте в начало и в конец массива arr число x 
    без использования функций append, insert и срезов
    (по аналогии со массивами в C/C++).
"""

#1.2: реализуйте вставку элемента в массив по индексу:
def insert(arr: list, length:int, index: int, element: int) -> list:
    """ Вставка значения element в массив arr 
        длины length по индексу index.

        Для результирующего массива должно быть справедливо следующее:
        arr[index] == element
        len(arr) == length + 1
    """
    pass

