# Проверка упорядоченности массива
# Решите эту задачу наиболее лаконичным образом 
# но без использования встроенных функций

def is_ordered(arr: list, N: int, ascending: bool=True) -> bool:
    """ Проверка массива arr длины N на упорядоченность.
        Если ascending равен True, то производится проверка того,
        что элементы массива расположены в восходящем порядке,
        иначе (когда ascending равен False) проверяется
        убывающий порядок.

        Если порядок соблюдён, то возвращается True,
        а иначе - False
    """
    pass