""" На вход подается массив целых чисел arr.

    Создайте массив arr2 на основе arr, возведя все чётные числа в квадрат, 
    а нечётные - в куб и сохранив порядокю

    Затем, на основе arr2 создайте два массива arr3 и arr4 из чисел, 
    которые нацело делятся на 3 и 4 соответственно, и верните их

"""

def task2(arr):
    """ Обработка массива.

        Вход:
            arr : List[int]
                Обрабатываемый массив целых чисел
        
        Выход:
            arr3 : List[int]
                Массив чисел из arr2, делящихся на 3
            arr4 : List[int]
                Массив чисел из arr2, делящихся на 4
    """
    pass
