""" Напишите алгоритм возведения числа в степень,
    работающий за время O(sqrt(n)), где n - степень
"""

def pow_n(x, n):
    """ Быстрое возведение числа в степень.

        Вход:
            x : float
                Число, возводимое в степень
            n : int
                Степень, в которую надо возвести число x
        
        Выход:
            result : float
                Результат вычисления x^n                
    """
    pass


# assert pow_n(1, 2) == 1
# assert pow_n(0, 2) == 0
# assert pow_n(0, 0) == 1
# assert pow_n(2, 10) == 1024
# assert pow_n(12, 5) == 248832
# assert pow_n(3, 12) == 531441
# assert pow_n(7, 0) == 1
# assert pow_n(7, 1) == 7