""" Даны две функции:
    
        1) F(x, y, z) = {
            G(x - 2, y // 2) + G(y - 1, z - 2), if (x >= 2, y >= 1, z >= 2)
            x + y + z                         , else
        }

        2) G(x, y) = {
            F(x // 3, y - 1, |x - y|), if (x >= 0, y >= 1)
            1                        , else
        }
        
    По трём входным числам x, y, z посчитать знаение F(x, y, z)
"""



# assert F(1, 1, 1) == 3
# assert F(2, 1, 2) == 2
# assert F(4, 4, 4) == 4
# assert F(15, 60, 23) == 122
# assert F(652, 681, 314) == 9053


