# Найти максимально достижимое число
# оригинальное условие: https://leetcode.com/problems/find-the-maximum-achievable-number/description/

""" Даны 2 целых числа: num и t
    Назовём число x ДОСТИГАЕМЫМ, если оно может стать равным num 
    после применения следующих операций в количестве не большем,
    чем t штук:
        - увеличить или уменьшить x на 1 и одновременно увеличить или уменьшить num на 1
    
    Вернуть максимальное достигаемое число.

    #1: num=4, t=1
    > 6

    #2: num=3, t=2
    > 7
"""

pass