# Число после двойного переворота
#оригинальное условие: https://leetcode.com/problems/a-number-after-a-double-reversal/

""" Операция поворта числа - это перестановка цифр в обратном порядке. 
    Например: 2021 -> 1202, а 12300 -> 321,  т.к. передние нули не значимы.

    Дано целое число num. Переверните его и получите число reversed1, 
    затем переверните его и получите reversed2. 
    Верните True, если reversed2 равен num, а иначе верните False

    #1: num=526
    > True

    #2: num=1800
    > False

    #3: num=0
    > True
"""

pass