
from random import choice
a = ['\033[94m', '\033[96m', '\033[92m', '\033[93m', '\033[91m']
kz = """Гимн Республики Казахстан:
Алтын күн аспаны,
Алтын дән даласы,
Ерліктің дастаны,
Еліме қарашы!
Ежелден ер деген,
Даңқымыз шықты ғой.
Намысын бермеген,
Қазағым мықты ғой!

Қайырмасы:

Менің елім, менің елім,
Гүлің болып егілемін,
Жырың болып төгілемін, елім!
Туған жерім менің – Қазақстаным!


Ұрпаққа жол ашқан,
Кең байтақ жерім бар.
Бірлігі жарасқан,
Тәуелсіз елім бар.
Қарсы алған уақытты,
Мәңгілік досындай,
Біздің ел бақытты,
Біздің ел осындай!

Қайырмасы:

Менің елім, менің елім,
Гүлің болып егілемін,
Жырың болып төгілемін, елім!
Туған жерім менің – Қазақстаным!"""
print(choice(a) + kz + '\033[0m')

